tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/0.orig/T
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object T;
}

dimensions [0 0 0 1 0 0 0];
internalField uniform 293.15;

boundaryField
{
    towerInlet { type uniformFixedValue; uniformValue constant 293.15; }
    walls { type zeroGradient; }
    atmosphere
    {
        type inletOutlet;
        inletValue uniform 293.15;
        value uniform 293.15;
    }
    frontAndBack { type empty; }
}

