tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/0.orig/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);

boundaryField
{
    #include "includes/towerInlet_U"

    walls { type noSlip; }
    atmosphere
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }
    frontAndBack { type empty; }
}

