tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/0.orig/alpha.water
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object alpha.water;
}

dimensions [0 0 0 0 0 0 0];
internalField uniform 0;

boundaryField
{
    #include "includes/towerInlet_alpha.water"

    walls { type zeroGradient; }
    atmosphere
    {
        type inletOutlet;
        inletValue uniform 0;
        value uniform 0;
    }
    frontAndBack { type empty; }
}

