tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/0.orig/includes/towerInlet_U
towerInlet
{
    type uniformFixedValue;
    uniformValue
    {
        type table;
        outOfBounds clamp;
        interpolationScheme linear;
        values
        (
            (0 (0 0 0))
            (0.05 (0 0 0))
            (0.1 (0 0 0))
            (0.15 (0 0 0))
            (0.2 (0 0 0))
            (0.25 (0 0 0))
            (0.3 (0 0 0))
            (0.35 (0 0 0))
            (0.4 (0 0 0))
            (0.45 (0 0 0))
            (0.5 (0 0 0))
            (0.55 (0 0 0))
            (0.6 (0 0.131683294 0))
            (0.65 (0 0.251243516 0))
            (0.7 (0 0.270869519 0))
            (0.75 (0 0.286691243 0))
            (0.8 (0 0.313034751 0))
            (0.85 (0 0.326642046 0))
            (0.9 (0 0.350226451 0))
            (0.95 (0 0.372802187 0))
            (1 (0 0.385062387 0))
            (1.05 (0 0.408994113 0))
            (1.1 (0 0.421542103 0))
            (1.15 (0 0.449490864 0))
            (1.2 (0 0.476161473 0))
            (1.25 (0 0.506852366 0))
            (1.3 (0 0.262488634 0))
            (1.35 (0 -0.126782325 0))
            (1.4 (0 -0.0715447006 0))
            (1.45 (0 -0.196349303 0))
            (1.5 (0 -0.205812787 0))
            (1.55 (0 -0.201022864 0))
            (1.6 (0 -0.140427233 0))
            (1.65 (0 0.575771624 0))
            (1.7 (0 0.123093798 0))
            (1.75 (0 0.194826931 0))
            (1.8 (0 0.180439118 0))
            (1.85 (0 0.0444925018 0))
            (1.9 (0 0.0341671294 0))
            (1.95 (0 -0.04994003 0))
            (2 (0 -0.0990253422 0))
            (2.05 (0 -0.0623984046 0))
            (2.1 (0 -0.085460372 0))
            (2.15 (0 -0.156521706 0))
            (2.2 (0 -0.235424854 0))
            (2.25 (0 -0.252583041 0))
            (2.3 (0 -0.332924518 0))
            (2.35 (0 -0.312785779 0))
            (2.4 (0 -0.400678582 0))
            (2.45 (0 -0.284903348 0))
        );
    }
    value uniform (0 0 0);
}
