tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/0.orig/includes/towerInlet_alpha.water
towerInlet
{
    type uniformInletOutlet;
    phi phi;
    uniformInletValue
    {
        type table;
        outOfBounds clamp;
        interpolationScheme linear;
        values
        (
            (0 0)
            (0.05 0)
            (0.1 0)
            (0.15 0)
            (0.2 0)
            (0.25 0)
            (0.3 0)
            (0.35 0)
            (0.4 0)
            (0.45 0)
            (0.5 0)
            (0.55 0)
            (0.6 2.56870221e-05)
            (0.65 0.950078648)
            (0.7 0.967020528)
            (0.75 0.970629194)
            (0.8 0.974433008)
            (0.85 0.977757124)
            (0.9 0.981387801)
            (0.95 0.986535555)
            (1 0.991416672)
            (1.05 0.989045186)
            (1.1 0.98447626)
            (1.15 0.986380954)
            (1.2 0.987527369)
            (1.25 0.98867633)
            (1.3 0.532461688)
            (1.35 0.328306811)
            (1.4 0.334320905)
            (1.45 0.311133584)
            (1.5 0.312651657)
            (1.55 0.30807787)
            (1.6 0.309069504)
            (1.65 0.3552526)
            (1.7 0.353327889)
            (1.75 0.391433238)
            (1.8 0.406515289)
            (1.85 0.474248482)
            (1.9 0.475481429)
            (1.95 0.447875295)
            (2 0.430267538)
            (2.05 0.429835677)
            (2.1 0.471613344)
            (2.15 0.435829601)
            (2.2 0.461177313)
            (2.25 0.33858353)
            (2.3 0.409627033)
            (2.35 0.30101189)
            (2.4 0.511048421)
            (2.45 0.312923035)
        );
    }
    value uniform 0;
}
