tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/0.orig/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;

boundaryField
{
    towerInlet { type calculated; value uniform 101325; }
    walls { type calculated; value uniform 101325; }
    atmosphere { type calculated; value uniform 101325; }
    frontAndBack { type empty; }
}

