tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/constant/g
FoamFile
{
    version 2.0;
    format ascii;
    class uniformDimensionedVectorField;
    object g;
}

dimensions [0 1 -2 0 0 0 0];
value (0 -9.81 0);

