tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/constant/thermophysicalProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object thermophysicalProperties;
}

phases (water air);
pMin 50000;

// Kept consistent with the inherited area-equivalent planar-slit model.
sigma
{
    type constant;
    sigma 0;
}

