tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/constant/thermophysicalProperties.air
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object thermophysicalProperties;
}

thermoType
{
    type heRhoThermo;
    mixture pureMixture;
    transport const;
    thermo hConst;
    equationOfState perfectGas;
    specie specie;
    energy sensibleInternalEnergy;
}

mixture
{
    specie { molWeight 28.965; }
    thermodynamics { Cp 1005; Hf 0; }
    transport { mu 1.81e-05; Pr 0.71; }
}

