tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/constant/thermophysicalProperties.water
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object thermophysicalProperties;
}

thermoType
{
    type heRhoThermo;
    mixture pureMixture;
    transport const;
    thermo hConst;
    equationOfState perfectFluid;
    specie specie;
    energy sensibleInternalEnergy;
}

mixture
{
    specie { molWeight 18.01528; }
    equationOfState { R 2.2e6; rho0 998.2; }
    thermodynamics { Cp 4182; Hf 0; }
    transport { mu 1.003e-3; Pr 7.0; }
}

