tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/system/blockMeshDict
/* Case B: one-way-coupled 2-D top-plume domain. */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

// The inherited planar mouth width is W=Dt^2/D=0.0017159574 m.
// The coupling plane is the centre of the last complete old-mesh cell row at
// y=0.6555625 m.  The local nozzle therefore spans the physical 0.0014375 m
// distance from that plane to the experimental rim at y=0.657 m.
vertices
(
    (-0.0008579787 -0.0014375 -0.002) // 0
    ( 0.0008579787 -0.0014375 -0.002) // 1
    (-0.0008579787  0.000 -0.002) // 2
    ( 0.0008579787  0.000 -0.002) // 3
    (-0.0008579787 -0.0014375  0.002) // 4
    ( 0.0008579787 -0.0014375  0.002) // 5
    (-0.0008579787  0.000  0.002) // 6
    ( 0.0008579787  0.000  0.002) // 7

    (-0.1200000000  0.000 -0.002) // 8
    ( 0.1200000000  0.000 -0.002) // 9
    (-0.1200000000  0.600 -0.002) // 10
    (-0.0008579787  0.600 -0.002) // 11
    ( 0.0008579787  0.600 -0.002) // 12
    ( 0.1200000000  0.600 -0.002) // 13
    (-0.1200000000  0.000  0.002) // 14
    ( 0.1200000000  0.000  0.002) // 15
    (-0.1200000000  0.600  0.002) // 16
    (-0.0008579787  0.600  0.002) // 17
    ( 0.0008579787  0.600  0.002) // 18
    ( 0.1200000000  0.600  0.002) // 19
);

blocks
(
    hex (0 1 3 2 4 5 7 6)       (6 6 1)    simpleGrading (1 1 1)
    hex (8 2 11 10 14 6 17 16)  (24 120 1) simpleGrading (0.15 2 1)
    hex (2 3 12 11 6 7 18 17)   (6 120 1)  simpleGrading (1 2 1)
    hex (3 9 13 12 7 15 19 18)  (24 120 1) simpleGrading (6.6666667 2 1)
);

edges ();

boundary
(
    towerInlet
    {
        type patch;
        faces ((0 4 5 1));
    }

    walls
    {
        type wall;
        faces
        (
            (0 2 6 4)
            (1 5 7 3)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            // Open lower boundary outside the mouth.
            (8 14 6 2)
            (3 7 15 9)

            // Exterior sides and top.
            (8 10 16 14)
            (9 15 19 13)
            (10 11 17 16)
            (11 12 18 17)
            (12 13 19 18)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 3 2) (4 6 7 5)
            (8 2 11 10) (14 16 17 6)
            (2 3 12 11) (6 17 18 7)
            (3 9 13 12) (7 18 19 15)
        );
    }
);

mergePatchPairs ();
