tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     compressibleInterFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.55;

deltaT          1e-05;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.15;

maxAlphaCo      0.1;

maxDeltaT       0.0002;

functions
{
    plumeCentreline
    {
        type            probes;
        libs            ( sampling );
        fields          ( alpha.water U p );
        probeLocations  ( ( 0 0.002 0 ) ( 0 0.01 0 ) ( 0 0.02 0 ) ( 0 0.03 0 ) ( 0 0.04 0 ) ( 0 0.05 0 ) ( 0 0.075 0 ) ( 0 0.1 0 ) ( 0 0.125 0 ) ( 0 0.15 0 ) ( 0 0.175 0 ) ( 0 0.2 0 ) ( 0 0.25 0 ) ( 0 0.3 0 ) ( 0 0.35 0 ) ( 0 0.4 0 ) ( 0 0.45 0 ) ( 0 0.5 0 ) ( 0 0.55 0 ) );
        writeControl    adjustableRunTime;
        writeInterval   0.0025;
    }
}


// ************************************************************************* //
