tests/test_01_vw2011/cases/B_Dt12p7_Ha0610_Yfs0356/openfoam/2d_top_plume/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr 2;
        nAlphaSubCycles 2;
        cAlpha 1;
        MULESCorr no;
        nLimiterIter 5;
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-8;
        relTol 0;
    }
    ".*(rho|rhoFinal)" { solver diagonal; }
    "pcorr.*"
    {
        solver PCG;
        preconditioner
        {
            preconditioner GAMG;
            tolerance 1e-05;
            relTol 0;
            smoother DICGaussSeidel;
        }
        tolerance 1e-05;
        relTol 0;
        maxIter 100;
    }
    p_rgh
    {
        solver PCG;
        preconditioner
        {
            preconditioner GAMG;
            tolerance 1e-7;
            relTol 0;
            nVcycles 2;
            smoother DICGaussSeidel;
            nPreSweeps 2;
        }
        tolerance 1e-7;
        relTol 0.01;
        maxIter 30;
    }
    p_rghFinal
    {
        solver PCG;
        preconditioner
        {
            preconditioner GAMG;
            tolerance 1e-7;
            relTol 0;
            nVcycles 2;
            smoother DICGaussSeidel;
            nPreSweeps 2;
        }
        tolerance 1e-7;
        relTol 0;
        maxIter 30;
    }
    "U.*"
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-6;
        relTol 0.01;
        nSweeps 1;
    }
    "(T|k|B|nuTilda).*"
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-8;
        relTol 0.01;
        maxIter 100;
    }
}

PIMPLE
{
    momentumPredictor yes;
    transonic no;
    nOuterCorrectors 2;
    nCorrectors 3;
    nNonOrthogonalCorrectors 0;
}
